Revit 2027 API
ConversionFailures Properties
The BuiltInFailures.ConversionFailures type exposes the following members.
Properties
Name | Description
CannotConvertPercentToDouble |  Cannot convert concentration percent ' [Percentage Value] ' to double value
CannotConvertTempToDouble |  Cannot convert temperature '[Temperate Value]' to double value
CannotConvertToDouble |  Cannot convert '[Text] ' to double value
UndefinedFluidUnit |  Undefined fluid unit: '[Fluid Unit Type Name]'
UndefinedTemperatureUnit |  Undefined temperature unit: '[Temperature Unit Type Name]'
Top
See Also
Reference
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace